const CALCULATOR_DATA = {
  categories: ["공격력", "공격력 %", "치명타"],

  requiredDescriptions: {
    "공격력": [
      "캐릭터 레벨",
      "레벨업 보너스 카드 (합산)",
      "타이틀 보유 효과",
      "펫 공격력",
      "인챈트 (합산)",
      "목걸이 공격력",
      "목걸이 인장",
      "룬 워드",
      "패션 세트 효과",
      "소울 스트림",
      "소울 스트림(조건부)",
      "팔라딘(정의)",
      "무기 기본 공격력",
      "무기 각인",
      "무기 인장",
      "무기 숙련 연계",
      "엠블럼 공격력 % (인장 포함)",
      "무기 주 스탯 배율",
      "무기 부 스탯 배율"
    ],
    "공격력 %": [
      "아티팩트 %",
      "인챈트 %"
    ],
    "치명타": [
      "기본 스탯",
      "강화 물약",
      "음식"
    ]
  },

  optionalDescriptions: {
    "공격력": [],
    "공격력 %": [
      "룬 %",
      "스킬 %"
    ],
    "치명타": [
      "확률 %",
      "피해 %"
    ]
  }
};
